Revit 2026 API

# DocumentSettings Property

---

Provides access to general application settings, such as Categories.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Settings Settings { get; }
```
```vb
Public ReadOnly Property Settings As Settings
	Get
```
```cpp
public:
property Settings^ Settings {
	Settings^ get ();
}
```
```fsharp
member Settings : Settings with get
```

#### Property Value

Settings

Returns an object that provides access to various settings within Autodesk Revit. The Settings property returns an object that provides access to the categories within the Autodesk Revit project.

#### Reference

Document Class

Autodesk.Revit.DB Namespace